session-1.org
#+title: Session 1 -- Pokémon Types
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main_theme.css" />
# (local-set-key (kbd "C-c m") (lambda () (interactive) (evil-write-all nil) (org-publish-current-project)))

* Introduction

Due to time constraints, I believe it to be more instructive to take
a "learning by osmosis" approach to programming, and work a practical
example during the seminar.
The first session will introduce the most basic concepts in python as well as
the ~csv~ package, which is used to deal with csv files.

* Getting Help

Since by definition this style of teaching will omit many of the fundamentals,
it will be up to you to learn them yourself.
Hopefully by the end of this session you will have seen enough to be able
to read the [[https://docs.python.org/3/tutorial/index.html][Python Tutorial]] on your own.
The first 6 chapters should suffice for an introduction.
The [[https://docs.python.org/3/library/csv.html][CSV package reference]] is quite short and can be read in 20-30 minutes.
For general help there is also the
[[https://docs.python.org/3/library/index.html][library reference]] (may be hard to read) or the slightly easier but less
comprehensive [[https://www.w3schools.com/python/python_reference.asp][reference on w3schools]].



* The Problem Statement

Today, we are playing pokemon. Specifically we are playing a modified version
of pokemon called [[https://www.pokecommunity.com/threads/pokemon-too-many-types-as-seen-in-alpharads-video.501317/][Too Many Types]].
Each pokemon has up to three types and each move has one type.
When a pokemon attacks another with a move, the move's type is compared
against all the defending pokemon's types.
In each case the move can be
neutral (deals normal damage),
super effective (deals double damage),
not very effective (deals half damage),
or have no effect at all.
The information we need is available in a [[https://docs.google.com/spreadsheets/d/1WxYmHs_ZsgzLUrL8WfEGN-JHdToubXHvi942ViDIG8k/][spreadsheet]] online.
As you can see, it is too large to memorize in practive, so we will
be writing a program to calculate damage for us.
I have exported the relevant parts to csv files and cleaned them up slightly.
You can download [[file:resources/pokedex.csv][pokedex.csv]] and [[file:resources/typechart.csv][typechart.csv]] if you wish to follow along.

To determine how effective an attack is, compare the attacking move's type
against all the defender's types, and multiply the modifiers.
For example: Suppose the attacker uses a /fighting/ type move against a Pokemon
with types /normal/, /flying/ and /rock/.
The table shows that fighting type moves deal double damage against normal
type, half damage against flying type, and double damage against rock type.
So the result in this case is ~2 * 0.5 * 2 = 2~.

* The Code
We will now write some code line by line and explain what is going on in the process.
I encourage you to type the code yourself.
Even if you just look at the code below, copying it by typing it yourself
is much more beneficial than using your computer's copy function.
It is also worth noting that coding is exact. Pay special attention to the
following:
Punctuation such as colons (~:~), commas (~,~), periods (~.~), brackets (~[]()~) etc.
and upper case vs lower case letters.

First, since our data is given as two ~csv~ files, we will load the ~csv~ package.
#+begin_src python
  import csv
#+end_src
Next, we will load the data from the csv files into the program.
If you are following along, right click on the project files in Pycharm,
select /open in/ and then /explorer/.[fn::This is for windows users,
on MacOS select /open in/ and it should be the first
option, thought I don't know what it is called.
]

For this we will use a data structure called the /dictionary/.
