docs/session-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-26 Mon 14:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Session 1 &#x2013; Pokémon Types</title>
<meta name="author" content="Peter Hanukaev" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/main_theme.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Session 1 &#x2013; Pokémon Types</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org743ac35">1. Introduction</a></li>
<li><a href="#orgc9e67eb">2. Getting Help</a></li>
<li><a href="#org9ea99d7">3. The Problem Statement</a></li>
<li><a href="#org42d3cb0">4. The Code</a>
<ul>
<li><a href="#org448f433">4.1. Dictionaries</a></li>
<li><a href="#org446401b">4.2. The Assignment Operator</a></li>
<li><a href="#org820610f">4.3. Functions</a></li>
</ul>
</li>
<li><a href="#orgb57882e">5. Entire Code</a></li>
</ul>
</div>
</div>

<div id="outline-container-org743ac35" class="outline-2">
<h2 id="org743ac35"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Due to time constraints, I believe it to be more instructive to take
a "learning by osmosis" approach to programming, and work a practical
example during the seminar.
The first session will introduce the most basic concepts in python as well as
the <code>csv</code> package, which is used to deal with csv files.
</p>
</div>
</div>

<div id="outline-container-orgc9e67eb" class="outline-2">
<h2 id="orgc9e67eb"><span class="section-number-2">2.</span> Getting Help</h2>
<div class="outline-text-2" id="text-2">
<p>
Since by definition this style of teaching will omit many of the fundamentals,
it will be up to you to learn them yourself.
Hopefully by the end of this session you will have seen enough to be able
to read the <a href="https://docs.python.org/3/tutorial/index.html">Python Tutorial</a> on your own.
The first 6 chapters should suffice for an introduction.
The <a href="https://docs.python.org/3/library/csv.html">CSV package reference</a> is quite short and can be read in 20-30 minutes.
For general help there is also the
<a href="https://docs.python.org/3/library/index.html">library reference</a> (may be hard to read) or the slightly easier but less
comprehensive <a href="https://www.w3schools.com/python/python_reference.asp">reference on w3schools</a>.
</p>
</div>
</div>



<div id="outline-container-org9ea99d7" class="outline-2">
<h2 id="org9ea99d7"><span class="section-number-2">3.</span> The Problem Statement</h2>
<div class="outline-text-2" id="text-3">
<p>
Today, we are playing pokemon. Specifically we are playing a modified version
of pokemon called <a href="https://www.pokecommunity.com/threads/pokemon-too-many-types-as-seen-in-alpharads-video.501317/">Too Many Types</a>.
Each pokemon has up to three types and each move has one type.
When a pokemon attacks another with a move, the move's type is compared
against all the defending pokemon's types.
In each case the move can be
neutral (deals normal damage),
super effective (deals double damage),
not very effective (deals half damage),
or have no effect at all.
The information we need is available in a <a href="https://docs.google.com/spreadsheets/d/1WxYmHs_ZsgzLUrL8WfEGN-JHdToubXHvi942ViDIG8k/">spreadsheet</a> online.
As you can see, it is too large to memorize in practive, so we will
be writing a program to calculate damage for us.
I have exported the relevant parts to csv files and cleaned them up slightly.
You can download <a href="resources/pokedex.csv">pokedex.csv</a> and <a href="resources/typechart.csv">typechart.csv</a> if you wish to follow along.
</p>

<p>
To determine how effective an attack is, compare the attacking move's type
against all the defender's types, and multiply the modifiers.
For example: Suppose the attacker uses a <i>fighting</i> type move against a Pokemon
with types <i>normal</i>, <i>flying</i> and <i>rock</i>.
The table shows that fighting type moves deal double damage against normal
type, half damage against flying type, and double damage against rock type.
So the result in this case is <code>2 * 0.5 * 2 = 2</code>.
</p>
</div>
</div>

<div id="outline-container-org42d3cb0" class="outline-2">
<h2 id="org42d3cb0"><span class="section-number-2">4.</span> The Code</h2>
<div class="outline-text-2" id="text-4">
<p>
We will now write some code line by line and explain what is going on in the process.
I encourage you to type the code yourself.
Even if you just look at the code below, copying it by typing it yourself
is much more beneficial than using your computer's copy function.
It is also worth noting that coding is exact. Pay special attention to the
following:
Punctuation such as colons (<code>:</code>), commas (<code>,</code>), periods (<code>.</code>), brackets (<code>[]()</code>) etc.
and upper case vs lower case letters.
</p>

<p>
First, since our data is given as two <code>csv</code> files, we will load the <code>csv</code> package.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5317ac;">import</span> csv
</pre>
</div>
<p>
Next, we will load the data from the csv files into the program.
If you are following along, right click on the project files in Pycharm,
select <i>open in</i> and then <i>explorer</i>.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
For this we will use a data structure called the <i>dictionary</i>.
</p>
</div>
