session-1.org
** Dictionaries
A dictionary[fn::
Learn more about [[https://docs.python.org/3/tutorial/datastructures.html#dictionaries][dictionaries]]
] stores a collection of /keys/ and corresponding /values/.
Each key can occur in a dictionary /only once/,
but values corresponding to different keys may be the same.
The main usage for a dictionary is as follows:
If you have a key, you can ask the dictionary for the corresponding value.
We will explain dictionaries in more detail as we use them.

First, we want to get the information on Pokemon and their types out of
[[file:resources/pokedex.csv][pokedex.csv]].
We will use a dictionary for this.
The keys will be the names of the Pokemon,
and the corresponding value is going to be the list of its types.
The code for this looks as follows and we will step through it line by line
below.
#+begin_src python
  pokedex = {}
  with open('pokedex.csv', 'r') as dex:
      dex_reader = csv.DictReader(dex)
      for row in dex_reader:
          pokemon_name = row['Pokemon'].lower()
          types = [row['Type I'], row['Type II'], row['Type III']]
          pokedex[pokemon_name] = [t.lower() for t in types if t != '']
#+end_src

In the first line, we create an empty dictionary called ~pokedex~.
The symbol ~{}~ is the empty dictionary, and we it to the variable
named ~pokedex~. We could use any name here, and it is generally a good idea
to use names that make it easy to remember what variables are for.

The second line opens the file.
The ~open('pokedex.csv', 'r')~ tells python to open the file
named /pokedex.csv/, and that we are going to be /reading/ from it
(and not writing to it).
This gives us a /file handle/, that is an object that allows us to interact
with the file. In this case we named this object /dex/
(this is the ~as dex~ part of the line).
Again, we could have chose any other name.
Note that all subsequent lines begin with four spaces.
This is both intentional and necessary. The file will be closed automatically
once we write a line that does not being with four spaces.
A line beginning with four spaces is called /indented/ and lines
may be indented multiple times.

In the third line we create a so called /dictReader/, to read the csv
file properly.
The dict reader treats our csv as a collection of rows.
Each row is a dictionary where the keys are the names of the columns,
and the value is the text contained in that row and column.
Where do the names of the columns come from? The dictReader automatically
uses the first line of our csv file for the names.
We give this dict reader the name ~dex_reader~ for future use.

Now we want to process each row of our csv one by one.
This is done with the ~for x in y:~ construct.
If ~y~ is a collection of things, this allows us to do something
for each element ~x~ of this collection.
Here, we are going to do something for each ~row~ in the ~dex_reader~.
Again the name ~row~ is chosen by us, and we could have used any other name.

The next line gets the name of the Pokemon from each row, and stores it in
the variable ~pokemon_name~.
Here we see how we can use a dictionary:
The first column is named "Pokemon", and we can see this in the csv.
Then we write ~row['Pokemon']~.
This asks the dictionary ~row~: "What value do you have at the key 'Pokemon'?".
And we get the text contained in that field as a response.
We don't want to worry about spelling, so we make the name of the Pokemon
all lower case, useing the ~.lower()~ method.
To summarize, this asks the row for the text in the column named "Pokemon",
makes that text all lower case, and stores the result in the variable
named ~pokemon_name~.

Next, we get the Pokemon's types, by asking the the row for it's
values at the keys "Type I", "Type II" and "Type III".
We store these in a list by enclosing these three thigns in square brackets
~[ ]~.
We save the list of types in a variable named ~types~.

