docs/session-1.html
<div id="outline-container-org448f433" class="outline-3">
<h3 id="org448f433"><span class="section-number-3">4.1.</span> Dictionaries</h3>
<div class="outline-text-3" id="text-4-1">
<p>
A dictionary<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> stores a collection of <i>keys</i> and corresponding <i>values</i>.
Each key can occur in a dictionary <i>only once</i>,
but values corresponding to different keys may be the same.
The main usage for a dictionary is as follows:
If you have a key, you can ask the dictionary for the corresponding value.
We will explain dictionaries in more detail as we use them.
</p>

<p>
First, we want to get the information on Pokemon and their types out of
<a href="resources/pokedex.csv">pokedex.csv</a>.
We will use a dictionary for this.
The keys will be the names of the Pokemon,
and the corresponding value is going to be the list of its types.
The code for this looks as follows and we will step through it line by line
below.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00538b;">pokedex</span> = {}
<span style="color: #5317ac;">with</span> <span style="color: #8f0075;">open</span>(<span style="color: #2544bb;">'pokedex.csv'</span>, <span style="color: #2544bb;">'r'</span>) <span style="color: #5317ac;">as</span> dex:
    <span style="color: #00538b;">dex_reader</span> = csv.DictReader(dex)
    <span style="color: #5317ac;">for</span> row <span style="color: #5317ac;">in</span> dex_reader:
        <span style="color: #00538b;">pokemon_name</span> = row[<span style="color: #2544bb;">'Pokemon'</span>].lower()
        <span style="color: #00538b;">types</span> = [row[<span style="color: #2544bb;">'Type I'</span>], row[<span style="color: #2544bb;">'Type II'</span>], row[<span style="color: #2544bb;">'Type III'</span>]]
        <span style="color: #00538b;">pokedex</span>[pokemon_name] = [t.lower() <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> types <span style="color: #5317ac;">if</span> t != <span style="color: #2544bb;">''</span>]
</pre>
</div>

<p>
In the first line, we create an empty dictionary called <code>pokedex</code>.
The symbol <code>{}</code> is the empty dictionary, and we it to the variable
named <code>pokedex</code>. We could use any name here, and it is generally a good idea
to use names that make it easy to remember what variables are for.
</p>

<p>
The second line opens the file.
The <code>open('pokedex.csv', 'r')</code> tells python to open the file
named <i>pokedex.csv</i>, and that we are going to be <i>reading</i> from it
(and not writing to it).
This gives us a <i>file handle</i>, that is an object that allows us to interact
with the file. In this case we named this object <i>dex</i>
(this is the <code>as dex</code> part of the line).
Again, we could have chose any other name.
Note that all subsequent lines begin with four spaces.
This is both intentional and necessary. The file will be closed automatically
once we write a line that does not being with four spaces.
A line beginning with four spaces is called <i>indented</i> and lines
may be indented multiple times.
</p>

<p>
In the third line we create a so called <i>dictReader</i>, to read the csv
file properly.
The dict reader treats our csv as a collection of rows.
Each row is a dictionary where the keys are the names of the columns,
and the value is the text contained in that row and column.
Where do the names of the columns come from? The dictReader automatically
uses the first line of our csv file for the names.
We give this dict reader the name <code>dex_reader</code> for future use.
</p>

<p>
Now we want to process each row of our csv one by one.
This is done with the <code>for x in y:</code> construct.
If <code>y</code> is a collection of things, this allows us to do something
for each element <code>x</code> of this collection.
Here, we are going to do something for each <code>row</code> in the <code>dex_reader</code>.
Again the name <code>row</code> is chosen by us, and we could have used any other name.
</p>

<p>
The next line gets the name of the Pokemon from each row, and stores it in
the variable <code>pokemon_name</code>.
Here we see how we can use a dictionary:
The first column is named "Pokemon", and we can see this in the csv.
Then we write <code>row['Pokemon']</code>.
This asks the dictionary <code>row</code>: "What value do you have at the key 'Pokemon'?".
And we get the text contained in that field as a response.
We don't want to worry about spelling, so we make the name of the Pokemon
all lower case, useing the <code>.lower()</code> method.
To summarize, this asks the row for the text in the column named "Pokemon",
makes that text all lower case, and stores the result in the variable
named <code>pokemon_name</code>.
</p>

<p>
Next, we get the Pokemon's types, by asking the the row for it's
values at the keys "Type I", "Type II" and "Type III".
We store these in a list by enclosing these three thigns in square brackets
<code>[ ]</code>.
We save the list of types in a variable named <code>types</code>.
</p>
</div>
</div>
