session-1.org
** The Assignment Operator

When we write ~x = ...~ in python, here is what happens:
First, python computes what is on the right side of the equals sign (~=~).
/Then/, it stores the value in ~x~.

With this in mind we can decipher the last line.
First, lets look at the right of the equal sign:
#+begin_src python
 [t.lower() for t in types if t != '']
#+end_src
This is called a /list comprehension/.[fn::
Learn more about [[https://docs.python.org/3/tutorial/introduction.html#lists][lists]] and [[https://docs.python.org/3/tutorial/datastructures.html#list-comprehensions][list comprehensions]]
]
Its value, once computed is a list.
What are the elements of the list?
For each element of the list ~types~,
if that element is not the empty string,
then that element is made to be all lower case,
and then added to the resulting list.
Let's dissect this more:
~for t in types~ tells us we will be looking at each element of the list
~types~. Next, ~if t != ''~ tells us to only look at an element
if it is not equal to the empty string. The notation ~t != ''~
can be read as "t is not equal to empty string".
Finally, the ~t.lower()~ part tells us that we will be adding the lower cased
version of the string to our resulting list.

Next let's look at the left side of the equals sign.
Since ~pokedex~ is a dictionary,
this is telling it, that the value corresponding to the key
~pokemon_name~ should be the list on the right side of the equals sign.

The next code block functions similarly:
#+begin_src python
  typechart = {}
  with open('typechart.csv', 'r') as t_chart:
      typechart_reader = csv.DictReader(t_chart)
      for row in typechart_reader:
          attacking_type = row['Attacking Type'].lower()
          multipliers = {}
          for t in row.keys():
              if t != 'Attacking Type':
                  multipliers[t.lower()] = float(row[t])
          typechart[attacking_type] = multipliers
#+end_src
The first five lines are analogous to the previous block
with different names.
The typechart is a table, and we want to access its elements
by specifying the name of a row and column.
For this, we will be storing dictionaries inside of a dictionary named
~typechart~.
The keys of ~typechart~ will be the names of the rows,
and the keys of the dictionaries inside of ~typechart~ will be
the names of the columns.
Why does this do the thing we want it to?
When we give ~typechart~ some key, it gives us the entire contents
of some row as a dictionary. Then, when we give the row the name of a column,
it can give us whatever it contains at that column.
This way we can reference cells by naming a row and column using only
dictionaries.

We create the dictionary ~multipliers~ and initially make it the empty
dictionary. In the last line,
we store it in the dictionary ~typechart~ under the key ~attacking_type~.
All we have left to do is to understand the three lines in between.

Recall from above, that the row in a dictReader is a dictionary,
whose keys are the names of the columns in our csv.
So, the line ~for t in row.keys():~ tells us we are doing something for
each key in the dictionary ~row~, i.e. for each column.

The next line is an /if statement/.
We check the condition, and the subsequent indeted code is only run
if the condition holds.
In this case, the condition we are checking for is that the name
of the column is not equal to "Attacking Type".
This is because this is the name of the first column, which contains the
names of our rows, and not the data we actuall care about. Hence, we want to
skip this column.

Finally, the last line saves some value to the dictionary multipliers
at the key ~t.lower()~ (i.e. the lowercased version of the column name).
What value is it? It is ~float(row[t])~. What does this mean?
First, ~row[t]~ is the text contained in the current row and column.
Python makes a distionction between the text consisiting of the three
characters zero "0", period "." and five "5", and the number ~0.5~.
To tell python that it should read this text as a number,
we have to enclose this value in ~float(...)~.
A ~float~ is a number that can have a decimal point.

