docs/session-1.html

<div id="outline-container-org446401b" class="outline-3">
<h3 id="org446401b"><span class="section-number-3">4.2.</span> The Assignment Operator</h3>
<div class="outline-text-3" id="text-4-2">
<p>
When we write <code>x = ...</code> in python, here is what happens:
First, python computes what is on the right side of the equals sign (<code>=</code>).
<i>Then</i>, it stores the value in <code>x</code>.
</p>

<p>
With this in mind we can decipher the last line.
First, lets look at the right of the equal sign:
</p>
<div class="org-src-container">
<pre class="src src-python">[t.lower() <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> types <span style="color: #5317ac;">if</span> t != <span style="color: #2544bb;">''</span>]
</pre>
</div>
<p>
This is called a <i>list comprehension</i>.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
Its value, once computed is a list.
What are the elements of the list?
For each element of the list <code>types</code>,
if that element is not the empty string,
then that element is made to be all lower case,
and then added to the resulting list.
Let's dissect this more:
<code>for t in types</code> tells us we will be looking at each element of the list
<code>types</code>. Next, <code>if t != ''</code> tells us to only look at an element
if it is not equal to the empty string. The notation <code>t != ''</code>
can be read as "t is not equal to empty string".
Finally, the <code>t.lower()</code> part tells us that we will be adding the lower cased
version of the string to our resulting list.
</p>

<p>
Next let's look at the left side of the equals sign.
Since <code>pokedex</code> is a dictionary,
this is telling it, that the value corresponding to the key
<code>pokemon_name</code> should be the list on the right side of the equals sign.
</p>

<p>
The next code block functions similarly:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00538b;">typechart</span> = {}
<span style="color: #5317ac;">with</span> <span style="color: #8f0075;">open</span>(<span style="color: #2544bb;">'typechart.csv'</span>, <span style="color: #2544bb;">'r'</span>) <span style="color: #5317ac;">as</span> t_chart:
    <span style="color: #00538b;">typechart_reader</span> = csv.DictReader(t_chart)
    <span style="color: #5317ac;">for</span> row <span style="color: #5317ac;">in</span> typechart_reader:
        <span style="color: #00538b;">attacking_type</span> = row[<span style="color: #2544bb;">'Attacking Type'</span>].lower()
        <span style="color: #00538b;">multipliers</span> = {}
        <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> row.keys():
            <span style="color: #5317ac;">if</span> t != <span style="color: #2544bb;">'Attacking Type'</span>:
                <span style="color: #00538b;">multipliers</span>[t.lower()] = <span style="color: #8f0075;">float</span>(row[t])
        <span style="color: #00538b;">typechart</span>[attacking_type] = multipliers
</pre>
</div>
<p>
The first five lines are analogous to the previous block
with different names.
The typechart is a table, and we want to access its elements
by specifying the name of a row and column.
For this, we will be storing dictionaries inside of a dictionary named
<code>typechart</code>.
The keys of <code>typechart</code> will be the names of the rows,
and the keys of the dictionaries inside of <code>typechart</code> will be
the names of the columns.
Why does this do the thing we want it to?
When we give <code>typechart</code> some key, it gives us the entire contents
of some row as a dictionary. Then, when we give the row the name of a column,
it can give us whatever it contains at that column.
This way we can reference cells by naming a row and column using only
dictionaries.
</p>

<p>
We create the dictionary <code>multipliers</code> and initially make it the empty
dictionary. In the last line,
we store it in the dictionary <code>typechart</code> under the key <code>attacking_type</code>.
All we have left to do is to understand the three lines in between.
</p>

<p>
Recall from above, that the row in a dictReader is a dictionary,
whose keys are the names of the columns in our csv.
So, the line <code>for t in row.keys():</code> tells us we are doing something for
each key in the dictionary <code>row</code>, i.e. for each column.
</p>

<p>
The next line is an <i>if statement</i>.
We check the condition, and the subsequent indeted code is only run
if the condition holds.
In this case, the condition we are checking for is that the name
of the column is not equal to "Attacking Type".
This is because this is the name of the first column, which contains the
names of our rows, and not the data we actuall care about. Hence, we want to
skip this column.
</p>

<p>
Finally, the last line saves some value to the dictionary multipliers
at the key <code>t.lower()</code> (i.e. the lowercased version of the column name).
What value is it? It is <code>float(row[t])</code>. What does this mean?
First, <code>row[t]</code> is the text contained in the current row and column.
Python makes a distionction between the text consisiting of the three
characters zero "0", period "." and five "5", and the number <code>0.5</code>.
To tell python that it should read this text as a number,
we have to enclose this value in <code>float(...)</code>.
A <code>float</code> is a number that can have a decimal point.
</p>
</div>
</div>
