session-1.org
** Functions

A /function/ is a bundled computation with a name.
The next two code block define two functions:
#+begin_src python
  def typechart_lookup(attacking, defending):
      return typechart[attacking][defending]

  def pokedex_lookup(attacking_type, defending_pokemon):
      result = 1
      types = pokedex[defending_pokemon]
      for t in types:
          result = result * typechart_lookup(attacking_type, t)
      return result
#+end_src
A function is defined by writing ~def~, then the name of the function,
here ~typechart_lookup~ and ~pokedex_lookup~, and finally a list of /parameters/
enclosed in parentheses.
Parameters are additional information we need to give a function in order to
use it. They are similar to a key for a dictionary, but a function can
perform complex computations instead of just looking up a value.
All the code belonging to a function must be indented.

The first function simply takes the names of an attacking type and
defending type and looks them up in our typechart.
The line ~return typechart[attacking][defending]~ tells us
that this function will give us back a value when we run it.
Specifically we will get whatever comes after the word ~return~.
A function's execution always ends when we encounter a ~return~,
so there can be no more code after the line containing ~return~.

The second function actually solves the problem we stated in the beginning:
We give it the name of an attacking type and the name of the defending pokemon
as parameters. And it computes for us how effective our attack is going to be.
In the first line we set ~result~ to ~1~, and in the last line
we return ~result~.
Let's look at what happens in between those lines:

First, we look to the pokedex, to get the defending pokemon's types,
and store the result (which is a list[fn::We
know this, because we made the ~pokedex~ a dictionary
which stores for each pokemon its list of types])
in a variable called types.
Then we go through each element of the list ~types~, using the ~for~-loop.

Finally, let's look at the line
#+begin_src python
  result = result * typechart_lookup(attacking_type, t)
#+end_src
Remember, we first evaluate the right side of the equality,
and then save the result to the variable on the left.
So, after this line executes, ~result~ is whatever it was before,
multiplied by the result of ~typchart_lookup(attacking_type, t)~.

To summarize we look up how the attacking type stack up against each of
the defeding Pokemon's types, and multiply the result by each of them
in turn. This is exactly what we described in the problem statement.

We can now test our program:
#+begin_src python
  print('fire attack vs chikorita:', pokedex_lookup('fire', 'chikorita'))
  print('grass attack vs lombre:', pokedex_lookup('grass', 'lombre'))
#+end_src
The ~print~ function tells python to show us the results as text.
Without it, python would just compute the numbers, and then not do
anything else with them.


* Entire Code
For convenience, here is the entire code in one place

#+begin_src python
  import csv

  pokedex = {}
  with open('pokedex.csv', 'r') as dex:
      dex_reader = csv.DictReader(dex)
      for row in dex_reader:
          pokemon_name = row['Pokemon'].strip().lower()
          types = [row['Type I'], row['Type II'], row['Type III']]
          pokedex[pokemon_name] = [t.lower() for t in types if t != '']

  typechart = {}
  with open('typechart.csv', 'r') as t_chart:
      typechart_reader = csv.DictReader(t_chart)
      for row in typechart_reader:
          attacking_type = row['Attacking Type'].lower()
          multipliers = {}
          for t in row.keys():
              if t != 'Attacking Type':
                  multipliers[t.lower()] = float(row[t])
          typechart[attacking_type] = multipliers

  def typechart_lookup(attacking_type, defending_type):
      return typechart[attacking_type][defending_type]

  def pokedex_lookup(attacking_type, defending_pokemon):
      result = 1
      types = pokedex[defending_pokemon]
      for t in types:
          result = result * typechart_lookup(attacking_type, t)
      return result

  print('fire attack vs chikorita:', pokedex_lookup('fire', 'chikorita'))
  print('grass attack vs lombre:', pokedex_lookup('grass', 'lombre'))
#+end_src
