docs/session-1.html

<div id="outline-container-org820610f" class="outline-3">
<h3 id="org820610f"><span class="section-number-3">4.3.</span> Functions</h3>
<div class="outline-text-3" id="text-4-3">
<p>
A <i>function</i> is a bundled computation with a name.
The next two code block define two functions:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5317ac;">def</span> <span style="color: #721045;">typechart_lookup</span>(attacking, defending):
    <span style="color: #5317ac;">return</span> typechart[attacking][defending]

<span style="color: #5317ac;">def</span> <span style="color: #721045;">pokedex_lookup</span>(attacking_type, defending_pokemon):
    <span style="color: #00538b;">result</span> = 1
    <span style="color: #00538b;">types</span> = pokedex[defending_pokemon]
    <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> types:
        <span style="color: #00538b;">result</span> = result * typechart_lookup(attacking_type, t)
    <span style="color: #5317ac;">return</span> result
</pre>
</div>
<p>
A function is defined by writing <code>def</code>, then the name of the function,
here <code>typechart_lookup</code> and <code>pokedex_lookup</code>, and finally a list of <i>parameters</i>
enclosed in parentheses.
Parameters are additional information we need to give a function in order to
use it. They are similar to a key for a dictionary, but a function can
perform complex computations instead of just looking up a value.
All the code belonging to a function must be indented.
</p>

<p>
The first function simply takes the names of an attacking type and
defending type and looks them up in our typechart.
The line <code>return typechart[attacking][defending]</code> tells us
that this function will give us back a value when we run it.
Specifically we will get whatever comes after the word <code>return</code>.
A function's execution always ends when we encounter a <code>return</code>,
so there can be no more code after the line containing <code>return</code>.
</p>

<p>
The second function actually solves the problem we stated in the beginning:
We give it the name of an attacking type and the name of the defending pokemon
as parameters. And it computes for us how effective our attack is going to be.
In the first line we set <code>result</code> to <code>1</code>, and in the last line
we return <code>result</code>.
Let's look at what happens in between those lines:
</p>

<p>
First, we look to the pokedex, to get the defending pokemon's types,
and store the result (which is a list<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>)
in a variable called types.
Then we go through each element of the list <code>types</code>, using the <code>for</code>-loop.
</p>

<p>
Finally, let's look at the line
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00538b;">result</span> = result * typechart_lookup(attacking_type, t)
</pre>
</div>
<p>
Remember, we first evaluate the right side of the equality,
and then save the result to the variable on the left.
So, after this line executes, <code>result</code> is whatever it was before,
multiplied by the result of <code>typchart_lookup(attacking_type, t)</code>.
</p>

<p>
To summarize we look up how the attacking type stack up against each of
the defeding Pokemon's types, and multiply the result by each of them
in turn. This is exactly what we described in the problem statement.
</p>

<p>
We can now test our program:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8f0075;">print</span>(<span style="color: #2544bb;">'fire attack vs chikorita:'</span>, pokedex_lookup(<span style="color: #2544bb;">'fire'</span>, <span style="color: #2544bb;">'chikorita'</span>))
<span style="color: #8f0075;">print</span>(<span style="color: #2544bb;">'grass attack vs lombre:'</span>, pokedex_lookup(<span style="color: #2544bb;">'grass'</span>, <span style="color: #2544bb;">'lombre'</span>))
</pre>
</div>
<p>
The <code>print</code> function tells python to show us the results as text.
Without it, python would just compute the numbers, and then not do
anything else with them.
</p>
</div>
</div>
</div>


<div id="outline-container-orgb57882e" class="outline-2">
<h2 id="orgb57882e"><span class="section-number-2">5.</span> Entire Code</h2>
<div class="outline-text-2" id="text-5">
<p>
For convenience, here is the entire code in one place
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5317ac;">import</span> csv

<span style="color: #00538b;">pokedex</span> = {}
<span style="color: #5317ac;">with</span> <span style="color: #8f0075;">open</span>(<span style="color: #2544bb;">'pokedex.csv'</span>, <span style="color: #2544bb;">'r'</span>) <span style="color: #5317ac;">as</span> dex:
    <span style="color: #00538b;">dex_reader</span> = csv.DictReader(dex)
    <span style="color: #5317ac;">for</span> row <span style="color: #5317ac;">in</span> dex_reader:
        <span style="color: #00538b;">pokemon_name</span> = row[<span style="color: #2544bb;">'Pokemon'</span>].strip().lower()
        <span style="color: #00538b;">types</span> = [row[<span style="color: #2544bb;">'Type I'</span>], row[<span style="color: #2544bb;">'Type II'</span>], row[<span style="color: #2544bb;">'Type III'</span>]]
        <span style="color: #00538b;">pokedex</span>[pokemon_name] = [t.lower() <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> types <span style="color: #5317ac;">if</span> t != <span style="color: #2544bb;">''</span>]

<span style="color: #00538b;">typechart</span> = {}
<span style="color: #5317ac;">with</span> <span style="color: #8f0075;">open</span>(<span style="color: #2544bb;">'typechart.csv'</span>, <span style="color: #2544bb;">'r'</span>) <span style="color: #5317ac;">as</span> t_chart:
    <span style="color: #00538b;">typechart_reader</span> = csv.DictReader(t_chart)
    <span style="color: #5317ac;">for</span> row <span style="color: #5317ac;">in</span> typechart_reader:
        <span style="color: #00538b;">attacking_type</span> = row[<span style="color: #2544bb;">'Attacking Type'</span>].lower()
        <span style="color: #00538b;">multipliers</span> = {}
        <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> row.keys():
            <span style="color: #5317ac;">if</span> t != <span style="color: #2544bb;">'Attacking Type'</span>:
                <span style="color: #00538b;">multipliers</span>[t.lower()] = <span style="color: #8f0075;">float</span>(row[t])
        <span style="color: #00538b;">typechart</span>[attacking_type] = multipliers

<span style="color: #5317ac;">def</span> <span style="color: #721045;">typechart_lookup</span>(attacking_type, defending_type):
    <span style="color: #5317ac;">return</span> typechart[attacking_type][defending_type]

<span style="color: #5317ac;">def</span> <span style="color: #721045;">pokedex_lookup</span>(attacking_type, defending_pokemon):
    <span style="color: #00538b;">result</span> = 1
    <span style="color: #00538b;">types</span> = pokedex[defending_pokemon]
    <span style="color: #5317ac;">for</span> t <span style="color: #5317ac;">in</span> types:
        <span style="color: #00538b;">result</span> = result * typechart_lookup(attacking_type, t)
    <span style="color: #5317ac;">return</span> result

<span style="color: #8f0075;">print</span>(<span style="color: #2544bb;">'fire attack vs chikorita:'</span>, pokedex_lookup(<span style="color: #2544bb;">'fire'</span>, <span style="color: #2544bb;">'chikorita'</span>))
<span style="color: #8f0075;">print</span>(<span style="color: #2544bb;">'grass attack vs lombre:'</span>, pokedex_lookup(<span style="color: #2544bb;">'grass'</span>, <span style="color: #2544bb;">'lombre'</span>))
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">This is for windows users,
on MacOS select <i>open in</i> and it should be the first
option, thought I don't know what it is called.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Learn more about <a href="https://docs.python.org/3/tutorial/datastructures.html#dictionaries">dictionaries</a></p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Learn more about <a href="https://docs.python.org/3/tutorial/introduction.html#lists">lists</a> and <a href="https://docs.python.org/3/tutorial/datastructures.html#list-comprehensions">list comprehensions</a></p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">We
know this, because we made the <code>pokedex</code> a dictionary
which stores for each pokemon its list of types</p></div></div>


</div>
</div></div>
</body>
</html>
